# Activity 1 - Basic SQL

In [1]:
import sqlite3
db = sqlite3.connect('eu_football_database.sqlite')

### Simple SELECT Queries

#### Basic SELECT Star

In [2]:
cursor = db.execute("SELECT * FROM Country")
cursor.fetchall()

[(1, 'Belgium'),
 (1729, 'England'),
 (4769, 'France'),
 (7809, 'Germany'),
 (10257, 'Italy'),
 (13274, 'Netherlands'),
 (15722, 'Poland'),
 (17642, 'Portugal'),
 (19694, 'Scotland'),
 (21518, 'Spain'),
 (24558, 'Switzerland')]

**Aggregation with COUNT**

In [3]:
cursor = db.execute('SELECT COUNT(*) FROM Team')

In [4]:
cursor.fetchone()

(299,)

**SELECT WHERE**

In [5]:
cursor = db.execute('SELECT * FROM Team WHERE team_long_name = "Real Madrid CF"')
cursor.fetchall()

[(43040, 8633, 243, 'Real Madrid CF', 'REA')]

In [6]:
cursor = db.execute('SELECT * FROM Country WHERE id = 1729')
cursor.fetchall()

[(1729, 'England')]

**OR and AND operators work as usual**

In [7]:
cursor = db.execute('SELECT * FROM Country WHERE id = 1729 OR id = 4769')
cursor.fetchall()

[(1729, 'England'), (4769, 'France')]

In [8]:
cursor = db.execute('SELECT * FROM Country WHERE id = 1729 OR id = 4769 OR id = 7809')
cursor.fetchall()

[(1729, 'England'), (4769, 'France'), (7809, 'Germany')]

**The IN Operator**

```sql
IN (value1, value2, ...)
```

In [9]:
cursor = db.execute('SELECT * FROM Country WHERE id IN (1729, 4769, 7809)')
cursor.fetchall()

[(1729, 'England'), (4769, 'France'), (7809, 'Germany')]

**BETWEEN works similarly too**

```sql
BETWEEN param1 AND param2
```

In [10]:
cursor = db.execute('SELECT * FROM Country WHERE id BETWEEN 1 AND 10000')
cursor.fetchall()

[(1, 'Belgium'), (1729, 'England'), (4769, 'France'), (7809, 'Germany')]

**ORDER BY**

```sql
ORDER BY attr (ASC(d)|DESC)
```

In [11]:
cursor = db.execute('SELECT * FROM Country ORDER BY id')
cursor.fetchall()

[(1, 'Belgium'),
 (1729, 'England'),
 (4769, 'France'),
 (7809, 'Germany'),
 (10257, 'Italy'),
 (13274, 'Netherlands'),
 (15722, 'Poland'),
 (17642, 'Portugal'),
 (19694, 'Scotland'),
 (21518, 'Spain'),
 (24558, 'Switzerland')]

In [12]:
cursor = db.execute('SELECT * FROM Country ORDER BY name')
cursor.fetchall()

[(1, 'Belgium'),
 (1729, 'England'),
 (4769, 'France'),
 (7809, 'Germany'),
 (10257, 'Italy'),
 (13274, 'Netherlands'),
 (15722, 'Poland'),
 (17642, 'Portugal'),
 (19694, 'Scotland'),
 (21518, 'Spain'),
 (24558, 'Switzerland')]

In [13]:
cursor = db.execute('SELECT * FROM Country ORDER BY name DESC')
cursor.fetchall()

[(24558, 'Switzerland'),
 (21518, 'Spain'),
 (19694, 'Scotland'),
 (17642, 'Portugal'),
 (15722, 'Poland'),
 (13274, 'Netherlands'),
 (10257, 'Italy'),
 (7809, 'Germany'),
 (4769, 'France'),
 (1729, 'England'),
 (1, 'Belgium')]

### LIKE parameter (wildcard)

* `%` represents many chars
* `_` only one character

In [14]:
cursor = db.execute('SELECT * FROM Team WHERE team_long_name LIKE "%madrid%"')
cursor.fetchall()

[(43040, 8633, 243, 'Real Madrid CF', 'REA'),
 (43053, 9906, 240, 'Atlético Madrid', 'AMA')]

In [15]:
cursor = db.execute('SELECT * FROM Team WHERE team_long_name LIKE "Real%"')
cursor.fetchall()

[(43040, 8633, 243, 'Real Madrid CF', 'REA'),
 (43045, 9869, 459, 'Real Sporting de Gijón', 'SPG'),
 (43047, 8603, 449, 'Real Betis Balompié', 'BET'),
 (43050, 10281, 462, 'Real Valladolid', 'VAL'),
 (43803, 8394, 244, 'Real Zaragoza', 'ZAR'),
 (44569, 8560, 457, 'Real Sociedad', 'SOC')]

In [16]:
cursor = db.execute('SELECT * FROM Team WHERE team_long_name LIKE "Real Madrid C_"')
cursor.fetchall()

[(43040, 8633, 243, 'Real Madrid CF', 'REA')]